#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-5413.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8f6e066a-10d9-4e1d-acc6-18552e0672eb]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4588592c-5cc4-4973-9655-d22d89a4003f]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-5413.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=71413233-8ae0-4837-a08e-63981d3a9aa3]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=f52e2b77-0da6-4e3f-a2ff-6f559c4e6c7c]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-5413.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3decb7a5-e19b-4ed5-afc7-7ee4e877bd9d]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4bce0ae4-8c9e-43b9-b6a2-81ab80d51283]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2f7e3930-cf59-430e-a675-78cfb092d685]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e3e15e97-426b-4cd8-83fe-32cdfc8e37d9]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=802cd761-f519-45cc-97d4-024e3cb7f8b7]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=827fa47e-a277-4ca1-8f70-32efebfde745]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-5413.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=13a0151c-9636-4a0a-a4b3-2fed549eb963]
module.keycloak_dev.module.onestopauth_basic.module.client_testrequest-10.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1804d617-0cf7-44f7-be0b-ef65c3cdee8f]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=09da8d35-2321-41e1-8426-6537bd712ae7]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1c0d6ed1-4c9c-4d2e-b6ec-6cb3bcd69066]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-5413.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=8f208ec4-fcf6-4314-9cf4-65dfe89f523b]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=75f152fc-ed9f-409d-bce8-0035c0d895c3]
module.keycloak_dev.module.onestopauth_basic.module.client_mar-1-test-1-b-ce-id-5941.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=2458780f-cd7c-4fb8-96b0-7964869bcefe]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-2-5645.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7bd00ac1-3007-4ecb-8fb3-b6501ae95206]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-4-5647.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4d31bce9-5155-4794-a24c-0e5f9dd7eb5b]
module.keycloak_dev.module.onestopauth_basic.module.client_mar-1-test-1-b-ce-id-5941.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=98d04e23-a727-455e-8c0e-247329ba7521]
module.keycloak_dev.module.onestopauth_basic.module.client_mar-1-test-1-b-ce-id-5941.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5e973eda-a6c4-4370-a21f-d7131a746443]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=dfd4fc73-bdca-4d80-a2cf-830c64578465]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=7d3b53b5-2eb8-46e8-8bd4-07379eebea72]
module.keycloak_dev.module.onestopauth_basic.module.client_mar-1-test-1-b-ce-id-5941.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=7e4e1379-77b0-4c7a-becf-555bba59151f]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d41103f5-8c51-4a83-ae6e-8cf373d77148]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=99c79e30-cb9b-42fa-bfd9-caf161c67729]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ee6a86a2-5463-4c19-8c67-534ceeca5b54]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c3f970ba-ca17-41d6-9d1b-82d93b2c0f73]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7915bc73-ef3a-466e-b682-ed5cd19a6daa]
module.keycloak_dev.module.onestopauth_basic.module.client_start-b-cei-d-dev-3302.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=19a6e226-0f97-40bf-8249-86b3b1cfd90a]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9cd98501-8ecc-496c-891f-57bfcf588b33]
module.keycloak_dev.module.onestopauth_basic.module.client_start-b-cei-d-dev-3302.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=49470a5b-df0e-4461-9937-98bc92169d12]
module.keycloak_dev.module.onestopauth_basic.module.client_start-b-cei-d-dev-3302.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=699e8064-a4e6-4432-b5aa-e5bdbbcac8bb]
module.keycloak_dev.module.onestopauth_basic.module.client_start-b-cei-d-dev-3302.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3d317744-172f-4573-8baf-3812a2493578]
module.keycloak_dev.module.onestopauth_basic.module.client_start-b-cei-d-dev-3302.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=177d4a0c-39d1-40cf-994b-a4e0528ab75c]
module.keycloak_dev.module.onestopauth_basic.module.client_start-b-cei-d-dev-3302.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4d1ee7f4-dc06-497d-b305-599d58985448]
module.keycloak_dev.module.onestopauth_basic.module.client_start-b-cei-d-dev-3302.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=86720f10-ba81-4365-85cd-599b79f258dc]
module.keycloak_dev.module.onestopauth_basic.module.client_start-b-cei-d-dev-3302.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=510bcaef-7de4-422f-801f-495a523d5d11]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=83d95a20-8363-4f99-8619-7b3991dba8d8]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=07ba0da1-dc37-450a-afb5-daef9551eb7e]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=55bb3928-b97f-4aae-9011-faf5a92d5d7e]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=96b9351e-8a31-49e0-b9c0-517639e7d236]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2871b1e0-719a-41b0-bc7c-a4db1923c469]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ded15d3f-dee9-47bd-b03b-f88dbd574868]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6f1e226a-a94f-4481-86a5-3459a7628694]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a6ae35d9-5d61-4705-ad38-c5136866a1a3]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidtest-5446.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=bb3c67ec-8d55-41f1-8693-e54976d94395]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3468.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4602c64b-fdf5-439d-8dfd-94b2a2d87c5e]
module.keycloak_dev.module.onestopauth_basic.module.client_testrequest-10.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8f8bb1a5-68b1-4441-a6d0-553586fc895d]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-4-5647.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ad9203d2-d9e2-4690-8f06-5d12e6307c36]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=0d093c22-ba7c-4d85-94bc-e3430d06f4fe]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5e79c1fb-5081-4b53-b637-6b42cec40c12]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=655e1e48-72b4-45e4-ad75-0223b0e7021b]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3468.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d8778526-a35a-471b-a951-bb1e04fabbf1]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3468.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4d8793e2-7000-4f0b-85c9-ee9c4be687cb]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f32acbb7-bf93-4b76-a104-99d74df97f59]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-4-5647.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2805786f-ec62-4a67-8f74-e8c55658bd20]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-4-5647.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0bc3a68a-f776-4196-8b86-9c2ff1cedde1]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3559989c-f390-416f-b178-dde31ae043eb]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-4-5647.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=dbb414f1-b822-46f2-b86b-23aa38918c7c]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=38153cb0-ed55-408b-ba7f-762efedd86cb]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a12d229c-f65f-49f5-b1a0-4bebda10e03c]
module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=022a7b3d-fac7-4562-9b3b-346078dc7cdd]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bf1e1545-c8b8-409f-8ae5-27a075372507]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=81ec1bdd-ac1e-45b5-a2a7-923c61fce091]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0a1f63c9-8b52-46e8-976c-6b475d33a12c]
module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=13337dba-71d0-4644-bee8-2fb81e27237f]
module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=85101d4a-d58c-4266-814e-914fa55c3ceb]
module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3bff73ee-cbf8-4142-b7d9-678e8bdc7af9]
module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=ea7a15fd-9b89-44ff-a41b-4417b6ed8fa3]
module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5b25cd19-e93f-4287-a708-021c27588723]
module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=40b351b0-95dc-4655-ba63-56591f01f65d]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=b83ebb29-7401-4cab-9251-875c00611c7d]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c052c8de-2ea9-4550-a802-4705c5a13e8e]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7302304e-4c40-47f9-9da0-bdff8e0553e2]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0652ce91-1e75-42ce-8966-465816dc9ad9]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=cb52b8da-11cd-4fe7-a4a5-de06310c7e19]
module.keycloak_dev.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=fe175114-f39a-4a62-a7ee-2fe3f30443dd]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ae671e67-97e8-4b38-8f19-df1556cc24eb]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ae454372-19c8-4093-87b5-154ad6f86588]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=6bf4a7ea-9952-4de7-8407-6914863d6fb6]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=29f2e000-710d-4665-81f8-a6435f59c77e]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=73a01703-e426-493a-8a55-a370969aebd1]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=62986da8-6133-421e-bed4-14cd0bb9f48e]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=bb3e060b-1097-4126-a79f-756d06016f2f]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=375fbf7f-3bca-4849-b17a-04d632b0cea4]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f32fbf2d-75df-44a0-8f57-a8ac02ee0432]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=09cc2a7d-7985-4b4c-93b0-e67399824cd5]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bc87549a-1f46-470f-abcf-750225a1846b]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=eb2ebbdb-f6b7-489b-a292-cdd76f84f3f0]
module.keycloak_dev.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=da9a081d-f876-4f6d-9ff7-229d5c4a4db7]
module.keycloak_dev.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=168fe5fb-b83d-41a3-8bd6-0d3bc997b4fb]
module.keycloak_dev.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=d35dfca4-2753-4423-9a4c-3114febab853]
module.keycloak_dev.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=378a7ed3-7a7e-47a8-9ac3-dffd1077d14f]
module.keycloak_dev.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=59428ca5-75f7-40d4-bc3a-6c0cd359c321]
module.keycloak_dev.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=59cbefeb-ff9c-4125-82c9-e16cfb121a71]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=db295ab1-fc62-4710-b041-1a280bd674d7]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ebc92afc-6a7a-4a74-a8cc-69fc0ca7b6f2]
module.keycloak_dev.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c62521e1-f097-472c-9a75-edc089b7ecb6]
module.keycloak_dev.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b58a9e06-30b2-4fd9-a042-8d46d15ce7e3]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300c4fbf-1228-4968-be76-d27a38079105]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_local-bcied-team-5.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "local-bcied-team-5"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_local-bcied-team-5.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_local-bcied-team-5.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_local-bcied-team-5.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_local-bcied-team-5.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "local-bcied-team-5"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_local-bcied-team-5.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_local-bcied-team-5.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_local-bcied-team-5.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_local-bcied-team-5.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "local-bcied-team-5"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "local-bcied-team-5"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:3000",
        ]
      + web_origins                              = [
          + "+",
          + "http://localhost:3000",
        ]
    }

  # module.keycloak_prod.module.onestopauth_basic.module.client_local-bcied-team-5.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "local-bcied-team-5"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_prod.module.onestopauth_basic.module.client_local-bcied-team-5.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_prod.module.onestopauth_basic.module.client_local-bcied-team-5.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_prod.module.onestopauth_basic.module.client_local-bcied-team-5.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_prod.module.onestopauth_basic.module.client_local-bcied-team-5.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "local-bcied-team-5"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_prod.module.onestopauth_basic.module.client_local-bcied-team-5.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_prod.module.onestopauth_basic.module.client_local-bcied-team-5.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_prod.module.onestopauth_basic.module.client_local-bcied-team-5.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_prod.module.onestopauth_basic.module.client_local-bcied-team-5.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "local-bcied-team-5"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "local-bcied-team-5"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:3000",
        ]
      + web_origins                              = [
          + "+",
          + "http://localhost:3000",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3564 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*